SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-48203-J

Comment( LMS 8F 2-8-0 Locomotive )

Comment( ************** General Information***************** )
Type ( Engine )
    WagonShape ( ccw_br_8f_48203.s )
    Size  ( 2.727624m 3.7817m 11.55m )
Mass ( 72.1t-uk )

Comment( ************ Coupler Information ****************** )
	
Comment( == Rear Coupler == )
Coupling (
		Type ( Bar )
		Spring (
			Break ( 710kN 1220kN )
			r0 ( 10cm 10cm )
		)
		CouplingHasRigidConnection (1)
	)
Comment( == Front Coupler == )
	Coupling (
			Type ( Chain )
			Spring (
			Break ( 600kN 1000kN )
			r0 ( 20cm 20cm )
			)
	CouplingHasRigidConnection (0)
	)
	
Comment( ************ Brakes, Type, Force, etc *************** )
BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 198kN ) Comment(Brake % 55 DWt or MTWt CoF 0.5)
MaxHandbrakeForce ( 0kN ) Comment(ctn calc)
Comment(BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg )) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ********* Curve Resistance & SuperElevation ********* )
CentreOfGravity ( 0m 2.95m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 17.0ft 3.0in )

Comment( ***************** Friction************************* )

ORTSBearingType ( Friction )

ORTSDavis_A ( 6598 )
ORTSDavis_B ( 24.11 )
ORTSDavis_C ( 5.342 )

ORTSWagonFrontalArea (100ft^2)
ORTSDavisDragConstant (0.0024)

Comment(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)


Lights	( 3
		Light	(
			comment( Glowing firebox )
			Type( 0 )
			Conditions	(
					Headlight ( 0 )
					Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.05 )
					LightColour ( eeff8800 )
					Position ( 0 2.1 -4.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1 )
   					Elevation ( -10 -10 -10 )
					)
			State	(
					Duration ( 0.05 )
					LightColour ( ffff8855 )
					Position ( 0 2.1 -4.15 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.05 )
   					Elevation ( -10 -10 -10 )
					)
				)
			)
		
		Light	(
			comment( Flickering Oil Lamp Position B )
			Type( 0 )
			Conditions	(
					Headlight ( 4 )
					Unit ( 2 )
					)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
			State	(
					Duration ( 0.02 )
					LightColour ( ff808000 )
					Position ( 1.11 1.42 5.38 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
			State	(
					Duration ( 0.2 )
					LightColour ( ccdddddd )
					Position ( 1.11 1.42 5.38 ) 
					Azimuth ( 0 0 0 )
					Transition ( 0 )
					Radius ( 0.45 )
					)
				)
			)
		)
	
Comment( ******* Miscellaneous Wagon Information************ )
    
FreightAnim ( "..\\common.headcodes\\CCW_8F\\CCW_8F_HC_ClassJ.s" 0 3.0 0.0 ) 

Comment(Passenger View)	
	Inside (
        PassengerCabinFile ( ccw_br_8f_48203.s )
        PassengerCabinHeadPos ( 1.5 3.0 -4.6  )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)

Engine ( OR-48203-J

Comment( *Known Parameters Required for OR - Engine Section*)

Comment (Section for Engine Effects - Steam Emissions, Stack) 

Effects
	(
	SteamSpecialEffects	(
	comment(the format of these little blocks is as follow:

	offset.x offset.y offset.z
	normal.x normal.y normal.z
	width in metres

	defining the offset from the shape pivot point where steam / 	smoke should appear, the direction it should go and the 	width of the nozzle
			)

			WhistleFX
			(
				0 3.85 -3.5
				0 0 1
				0.2
			)
			SafetyValvesFX
			(
				0 3.8 -3.2
				0 1 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.8 -2.8
				0 1 0
				0.2
			)
			StackFX
			(
				0 3.9 3.05
				0 0.95 0
				0.3
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-1 -1 -1
				0.05
			)

			Injectors1FX
			(
				-1.15 0.7 -4.7
				0 -1 0
				0.15
			)
			Injectors2FX
			(
				1.15 0.7 -4.7 
				0 -1 0
				0.15
			)

			CylindersFX
			(
				-1.023 0.35 3.45
				0 0.0875 1
				0.2
			)

			CylindersFX
			(
				1.023 0.35 3.45
				0 0.0875 1
				0.2
			)
		)
	)

Wagon ( OR-48203-J )
Comment ( *************General Information****************** )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 28.25in )
NumWheels ( 4 )
ORTSDriveWheelWeight ( 63.1t-uk )
Sanding ( 25mph )

Comment ( ******************** Boiler ************************ )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 218ft^3 )  Comment(Calculated from freight weight)
ORTSEvaporationArea ( 1649ft^2 )
ORTSSuperheatArea ( 241ft^2 )
MaxBoilerPressure ( 225psi )
Comment(MaxSteamHeatingPressure ( 80psi )) Comment(Assume no steam heating)

Comment ( ****************** Cylinders *********************** )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 18.5in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  

Comment ( ********************* Fire ************************* ) 

ORTSFuelCalorific ( 13700btu/lb )
ORTSGrateArea ( 28.65ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )     

Comment ( ********************* Fuel ************************* )

MaxTenderCoalMass ( 9t-uk )
MaxTenderWaterMass ( 40000lb )
IsTenderRequired( 1 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15 )

ORTSMaxIndicatedHorsepower ( 1600.0hp )

ORTSMaxSuperheatTemperature ( 275.0 )

Comment(ORTSCylinderPortOpening ( 0.085 ))
Comment(0.05 to 0.12)

ORTSBoilerEfficiency( 0.0 0.96  180.0 0.48 )
Comment(Report 8P Gr 16)

ORTSBurnRate( 0.0 10.0   12000.0 1000.0   21000.0 2000.0   27000.0 3000.0   36000.0 4000.0   37000.0 5000.0   37500.0 6000.0  )

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

    
Comment ( *****************Brake System ****************** )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control Sysytem (if used)**********        

Includes Monitoring of Overspeed, Vigilance, Emergency Braking 

*************************************************************)

     
Comment ( **************** Engine Controls ***************** )   
EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )
            
Brake_Hand ( 0 1 0.0125 0
	NumNotches ( 0 ))
FireDoor ( 4 4 0.4 0
	NumNotches ( 0 ))
Sanding( 0 1 0 )
Blower ( 0 1 0.025 0.2
	NumNotches ( 0 ))
HeatingTap ( 0 1 0.025 0
	NumNotches ( 0 ))
Shovel ( 0 1 0.1 0
	NumNotches ( 0 ))
DampersFront ( 0 1 0.1 1
	NumNotches ( 0 ))
DampersBack ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector1Steam ( 0 1 0 )
Injector2Steam ( 0 1 0 )
Injector1Water ( 0 1 0.1 0
	NumNotches ( 0 ))
Injector2Water ( 0 1 0.1 0
	NumNotches ( 0 ))
CylinderCocks ( 0 1 1 )
Whistle ( 0 1 0 )
WaterScoop ( 0 1 0 )
SmallEjectorOrCompressor( 0 1 1 )
BellToggle( 0 1 0 )
Headlights( 0 1 0 )
)

Comment ( ************ Miscellaneous Information ************* )   

Cabview ( Standard.cvf )
HeadOut (  -1.5 3.0 -4.6 )
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
Name ( "48203 LMS 8F, Class J, 2-8-0, Shed 2A Rugby, Coal 9t, Water 4000gal" )
Description (
"The London, Midland and Scottish Railway (LMS) Stanier Class 8F is a class of steam locomotives designed for hauling heavy freight. 852 were built between 1935 and 1946 (not all to LMS order), as a freight version of William Stanier's successful Black Five, and the class saw extensive service overseas during and after the Second World War.\n"+
"\n"+
"LMS freight traction suffered from the adoption of the Midland Railway's small engine policy which had left it with trains double-headed by underpowered 0-6-0s supplemented by disappointing Garratts and Fowler 7F 0-8-0s.\n"+
"\n"+
"The 8F design incorporated the two-cylinder arrangement of the Black Fives. They were initially classified 7F, but this was later changed to the more familiar 8F.\n"+
"\n"+
"On the outbreak of the World War II, the design was chosen to become the country's standard freight design, reprising the role the GCR Class 8K had in the First World War. The War Department had 208 8Fs built by Beyer Peacock and North British Locomotive Company and requisitioned 51 more.\n"+
"\n"+
"Stanier 8F production for the WD continued until 1943 when the cheaper WD Austerity 2-8-0 was introduced. Production for British domestic use continued until 1946.")
)
